# 1)შექმენი ფუნქცია, რომელსაც აქვს ერთი პარამეტრი —name.
# ფუნქციამ უნდა დააბრუნოს ტექსტი:
# გამარჯობა, [სახელი]!

# ფუნქცია გამოიძახე სხვადასხვა არგუმენტით მინიმუმ 3-ჯერ.

def greet(name):
    return f"hello {name}"

print(greet("nat"))
print(greet("kes"))
print(greet("ana"))




# 2)შექმენი ფუნქცია, რომელსაც აქვს ორი პარამეტრი — num1 და num2.
# ფუნქციამ უნდა დააბრუნოს მათი ჯამი.

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით


def numbers(num1, num2):
    return num1 + num2

print(numbers(2,3))
print(numbers(4,5))
print(numbers(6,7))



# 3)შექმენი ფუნქცია ერთი პარამეტრით num.

# ფუნქციამ უნდა დააბრუნოს (return) გადაცემული რიცხვის კვადრატი.

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით


def square(num):
    return num ** 2

print(square(3))
print(square(4))
print(square(5))




# 7) შექმენი ფუნქცია ერთი პარამეტრით — score.

# თუ ქულა ≥ 90 → დააბრუნოს "შესანიშნავი ქულა"
# თუ ქულა >= 70 და ნაკლებია ან <=89 → დააბრუნოს "კარგი ქულა"
# თუ ქულა >= 50 და <= 69 → დააბრუნოს "დამაკმაყოფილებელი ქულა"
# სხვა შემთხვევაში დააბრუნოს "ჩაჭრილი"
# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით



def grade(score):
    if score > 90:
        return "შესანიშნავი ქულა"
    elif score >= 70 and score <= 89:
        return "კარგი ქულა"
    elif score >= 50 and score <= 69:
        return "დამაკმაყოფილებელი ქულა"
    else: 
        return "ჩაჭრილი"
print(grade(91))
print(grade(71))
print(grade(5))




# 8) შექმენი ფუნქცია ერთი პარამეტრით — number.

# ფუნქციამ უნდა დააბრუნოს, ლუწია თუ კენტი.
# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით

def even_or_odd(num):
    if num % 2 == 0:
        return "even"
    else:
        return "odd"
    
print(even_or_odd(4))
print(even_or_odd(6))
print(even_or_odd(7))
