# 1) მომხმარებელს შემოატანინეთ სიტყვა.  
# -> იტერაციით გაიარეთ თითო ასო  
# -> თუ შეხვდებით ასო 'e'-ს ან 'E'-ს გაჩერდით (break)  
# -> დაბეჭდეთ მხოლოდ ის ასოები, რაც მანამდე იყო  

 

# 2) მომხმარებელს შემოატანინეთ წინადადება.  
# -> შეამოწმეთ არის თუ არა ტექსტში სიტყვა 'bad'  
# -> თუ არის, დაპრინტეთ "აკრძალული სიტყვა!"  
# -> თუ არაა, დაპრინტეთ "ყველაფერი რიგზეა"  

# 3) მომხმარებელს შემოატანინეთ წინადადება.  
# -> დაუარეთ ტექსტს for ციკლით  
# -> გამოტოვეთ ყველა space => ' '
# -> დაბეჭდეთ ყველა დანარჩენი სიმბოლო  

# 4) მომხმარებელს შემოატანინეთ წინადადება.  
# -> დაუარეთ მას for ლუპით  
# -> გამოტოვეთ ხმოვნები (a, e, i, o, u)  
# -> დაბეჭდეთ მხოლოდ თანხმოვნები და თავისთავათ ყველა სხვა სიმბოლო 

# 5) მომხმარებელს შემოაყვანით ორი რიცხვი
# --> დაუარეთ ყველა რიცვს ამ დიაპაზონში
# --> დაბეჭდეთ მხოლოდ რიგით პირველი რიცხვი ამ შუალედში რომელიც იყოფა 15-ზე(შეწყვიტეთ ციკლი თუ არის ეგეთი)

# 6) შექმენით უსასრულო while loop:
# --> სანამ მომხმარებელი არ შემოიყვანს 'python is best', მანამდე დაპრინტეთ 'you should learn python'

# 7) \<.BOSS.>/ 
# მომხმარებელს შემოაყვანით ორი რიცხვი
# --> დაუარეთ ყველა რიცვს ამ დიაპაზონში
# --> დაბეჭდეთ მხოლოდ რიგით მესამე რიცხვი ამ შუალედში რომელიც იყოფა 3-ზე(შეწყვიტეთ ციკლი თუ არის ეგეთი)